/*
1、什么是数组？（136）
  C语言规定用方括号中的数字来表示下标，如s[15]
2、怎样定义和引用一维数组
 （1）定义：类型说明符 数组名[常量表达式] 
     下标是从0开始
 （2）引用：数组名[下标] 
 （3）一堆数组的初始化（138）
 #排序方法（140）
3、怎样定义和引用二维数组（矩阵）
（1）定义：类型说明符 数组名[常量表达式][常量表达式]
（2）引用：数组名[下标][下标]
（3）初始化（144）
4、字符数组
（1）定义：如c[0]=‘i’
（2）初始化与引用（148）
（3）结束标志:'\0'
 (4)输入输出:%c与%s
（5）使用字符串处理函数
     输入输出------puts函数、gets函数：只能输入或输出一个字符串
	 连接----------strcat(字符数组1，字符数组2)：字符数组1必须足够大
	 复制----------strcpy和strncpy函数：strcpy(字符数组1，字符串2） 字符数组1必须足够大
	 比较----------strcmp(字符串1，字符串2）：在英文字典中位置在后面的为"大"
	 测字符串长度--strlen(字符数组) 
 */
#include <stdio.h>
int main()
{
 int a[10];//定义数组
 int i,j,t;
 printf("input 10 numbers:\n");
 for(i=0;i<10;i++)
    scanf("%d",&a[i]);//把十个随机数值赋给十个数组
 printf("\n");
 for(j=0;j<9;j++)//进行9次循环，实现9趟比较 
   for(i=0;i<9-j;i++)//在每一趟中进行9-j次比较，起泡法！！！ 
     if(a[i]>a[i+1]) //相邻两个数比较
	 {t=a[i];a[i]=a[i+1];a[i+1]=t;}//交换值，升序排列
 printf("the sorted numbers：\n");
 for(i=0;i<10;i++)
   printf("%d\t",a[i]);
 printf("\n");
 return 0;
 } 
